import React from "react";
import HeaderTop from "../components/header/HeaderTop";
import Footer from "../components/footer/Footer";


const SiteRules = () => {

    return(
        <div className="site-rules__container">
            <HeaderTop />
            <div className="container">
                <h1 className="policy__title">Правила и условия использования сайта</h1>
                <p className="policy__text">Эта страница содержит правила и условия («данные правила») для сайта hmel-avto.ru («данного веб-сайта»), владельцем которого является 
                ООО "ХМЕЛЬАВТО", предоставляющая услуги хостинга под брендом hmel-avto.ru («Хмел-авто»). Пользуясь этим веб-сайтом вы соглашаетесь 
                соблюдать данные правила, все применимые законы и постановления, и соглашаетесь, что вы ответственны за соблюдение любых применимых местных законов.
                Данные правила могут иногда обновляться. Hmel-avto может вносить изменения в настоящие правила в одностороннем порядке. 
                Ответственность за своевременное ознакомление с изменениями лежит на пользователе данного веб-сайта.</p>
                <p className="policy__text">Мы рекомендуем проверять эту страницу на предмет обновлений не реже раза в месяц. Вы также можете подписаться на 
                рассылку новостей нашей компании. Наши подписчики будут уведомлены о любых изменениях в Правилах и условиях использования официального сайта компании. 
                Пользуясь данным веб-сайтом вы соглашаетесь соблюдать текущую версию этих правил.</p>
                <p className="policy__text">На данный момент действуют правила в редакции от 29.02.2016 г.</p>

                <h2 className="policy__subtitle">Использование веб-сайта</h2>

                <p className="policy__text">Вам разрешено пользоваться данным веб-сайтом для своих личных и корпоративных нужд, распечатывать, а также скачивать материалы с 
                данного веб-сайта, при условии, что вы не будете изменять их содержимое без согласия правообладателя. Вы также вольны добавлять 
                страницы данного сайта в закладки, делиться ссылками, направляюищими других на содержимое данного веб-сайта. В иных случаях материалы 
                с данного веб-сайта не должны быть воспроизведены или переизданы онлайн либо оффлайн без разрешения правообладателя.</p>

                <h2 className="policy__subtitle">Интеллектуальная собственность</h2>

                <p className="policy__text">Все материалы, размещенные на данном веб-сайте, являются интеллектуальной собственностью компании ООО "ХМЕЛЬАВТО". Авторские и смежные 
                права на все материалы, размещаемые на данном веб-сайте, являются собственностью ООО "ХМЕЛЬАВТО" или наших лицензиаров и не должны быть 
                воспроизведены без нашего предварительного письменного согласия. Согласие может быть получено в простой письменной форме по почте, 
                электронной почте и/или факсу. Согласие должно быть выражено однозначно и недвусмысленно и быть заверено цифровой подписью или изображением 
                подписи генерального директора и/или директора по развитию ООО "ХМЕЛЬАВТО".</p>
                <p className="policy__text">Никакая часть этого сайта не может быть воспроизведена без предварительного письменного разрешения правообладателя.</p>

                <h2 className="policy__subtitle">Периоды работоспособности веб-сайта</h2>

                <p className="policy__text">Мы принимаем все разумные меры по обеспечению круглосуточной доступности данного веб-сайта. Мы понимаем, что доступность сайта 
                компании-хостера является важной частью имиджа и составным элементом репутации. Тем не менее, мы не можем гарантировать постоянную доступность данного сайта, 
                поскольку не можем полностью исключить действия факторов, не зависящих от нас.</p>

                <h2 className="policy__subtitle">Поведение посетителя</h2>

                <p className="policy__text">За исключением личной информации, использование которой осуществляется в рамках политики конфиденциальности данного веб-сайта, любой материал, 
                который вы посылаете для публикации на данном веб-сайте или самостоятельно публикуете на данном веб-сайте с использованием специальных форм, 
                будет считаться непатентованным и не будет являться конфиденциальным. Размещая материалы на данном веб-сайте вы соглашаетесь с тем, что мы в 
                праве скопировать, раскрыть, распространить, переработать и любым другим способом использовать такой материал в любых целях.</p>

                <p className="policy__text">При использовании данного веб-сайта вы не будете размещать или посылать на данный веб-сайт или с данного веб-сайта любые материалы:
                для которых вы не получили все необходимые разрешения которые являются дискриминационными, непристойными, порнографическими, оскорбительными, 
                разжигают расовую ненависть, нарушают конфиденциальность 
                или неприкосновенность частной жизни, могут создать неудобства другим пользователям, которые поощряют или представляют поведение, которое будет
                рассматриваться как уголовное преступление, приводят к гражданской ответственности, или другим образом противоречат действующему законодательству; или
                которые вредоносны по своей природе, в том числе (но не только) компьютерные вирусы, троянские программы, поврежденные данные или другое 
                потенциально вредоносное программное обеспечение или данные.</p>

                <p className="policy__text">Мы информируем о том, что будем сотрудничать с любыми правоохранительными органами и выполним постановление суда, требующее, чтобы мы раскрыли 
                личность или другие данные любого человека, опубликовавшего материал на данном веб-сайте в нарушение данных правил.
                Размещая материалы на данном веб-сайте, вы гарантируете и заявляете, что вы владеете или контролируете другим образом все права на этот материал, 
                в том числе все права, необходимые вам, чтобы предоставить, опубликовать, загрузить, ввести в обращение или отправить материал, или что использование 
                вами данного материала подпадает под действие одной из свободних лицензий и не ущемляет чьих-либо авторских и/или смежных прав.
                Вы соглашаетесь освободить и обезопасить и нас, и наших аффилиатов от любого вреда по любым и всем претензиям или требованиям, включая разумные 
                судебные издержки, которые могут возникнуть по факту публикации вашего контента или другим образом относятся к вашему использованию данного веб-сайта, 
                материалам, которыми вы снабдили данный веб-сайт, или вашим нарушением данных правил.</p>

                <h2 className="policy__subtitle">Ссылки на другие веб-сайты и с других веб-сайтов</h2>

                <p className="policy__text">Любые ссылки на сторонние веб-сайты, расположенные на этом веб-сайте предназначены только для вашего удобства. Мы не несем никакой ответственности 
                за содержание таких веб-сайтов третьих лиц и организаций или за их содержание. Мы не поддерживаем сторонние веб-сайты и не представляем их владельцев 
                и/или авторов любого материала, опубликованного на них. Если вы перейдете на сторонний веб-сайт, связанный с данным веб-сайтом ссылкой, вы сделаете это на свой страх и риск.
                Ссылки на сторонние веб-сайты могут быть партнерскими. В этом случае мы можем получать комиссию, если вы купите определенный продукт или выполните 
                определенное действие на сайте-партнере.</p>

                <p className="policy__text">Если вы хотите сослаться на данный веб-сайт, вы можете сделать это только на том основании, что вы ссылаетесь, но не воспроизводите любую страницу 
                с данного веб-сайта и при соблюдении следующих условий:</p>
                
                <ul className="policy__list">
                    <li className="policy__list-item">вы ни коим образом не обозначаете, что мы поддерживаем какие-либо услуги или продукты, если это не было специально согласовано с нами и вами не 
                    получено соответствующее уведомление от нас в простой письменной форме;</li>
                    <li className="policy__list-item">вы не искажаете ваши отношения с нами и/или не представляете ложную информацию о нашей компании;</li>
                    <li className="policy__list-item">вы не ссылаетесь с веб-сайта, который не принадлежит вам;</li>
                </ul>
                
                <p className="policy__text">и ваш сайт не содержит материалов, которые являются оскорбительными, противоречивыми, нарушают какие-либо 
                права на интеллектуальную собственность 
                или другие права любого другого человека и/или организации или противоречат каким-либо образом любым применимым законам.
                Если вы все же будете ссылаться на наш веб-сайт в нарушение данных правил, то вы в полной мере компенсируете нам любые убытки или ущерб, 
                понесенный в результате ваших действий.</p>
                
                <h2 className="policy__subtitle">Отказ от ответственности</h2>
                
                <p className="policy__text">Данный веб-сайт предназначен исключительно для информационных целей, и мы не гарантируем правильность и полноту материалов на данном веб-сайте. 
                Мы можем вносить изменения в материалы на данном веб-сайте в любое время и без предварительного уведомления. Материалы на этом сайте могут быть 
                устаревшими или, в редких случаях, неправильными, и мы не даем никаких обязательств и гарантий в том, что подобные материалы являются правильными или актуальными.
                Материалы на данном веб-сайте предоставляются без каких-либо условий или гарантий любого рода. В максимальной степени, разрешенной законом, 
                мы предоставляем доступ к этому веб-сайту и возможность использования данного веб-сайта на том основании, что мы исключаем все заверения, 
                гарантии и условия, которые за исключением данных правил могут иметь силу в отношении данного веб-сайта. Материалы на данном веб-сайте 
                предоставляется «как есть», и вы используете их на свой страх и риск.</p>
                
                <p className="policy__text">Информация, содержащаяся на данном веб-сайте является общей информацией и комментариями. Эта информация не принимает во внимание ваши конкретные 
                обстоятельства и никоим образом не является рекомендательной для вас в юридической, деловой или любой другой сфере.
                Вы понимаете, что ответственность по всем и каждому материалам, размещаемым на данном веб-сайте, несут индивиды, которые первоначально 
                разместили материал. Вы также понимаете, что все мнения, высказанные пользователями данного сайта выражают строго их личное мнение, 
                а не мнение представителя сайта, его владелеца или любого из спонсоров или партнеров.</p>

                <h2 className="policy__subtitle">Освобождение от ответственности</h2>

                <p className="policy__text">Ни мы, ни любая другая сторона (участвующая или нет в создании, обслуживании или предоставлении этого веб-сайта), не несем ответственности 
                и не отвечаем за любой ущерб или повреждения, которые могут быть причинены вам или третьей стороне в результате вашего или их использования 
                нашего веб-сайта. Это освобождение включает обслуживание или затраты на ремонт и, без ограничения, любые другие прямые, непрямые или косвенные 
                потери, правонарушения или соглашения, или иные действия связанные с данным веб-сайтом.</p>

                <h2 className="policy__subtitle">Прекращение использования</h2>

                <p className="policy__text">Вы соглашаетесь, что мы можем, по нашему собственному усмотрению, прекратить или приостановить доступ ко всему или части данного веб-сайта 
                с или без предварительного уведомления и по любой причине, в том числе, без ограничения, за нарушение данных правил.</p>

                <h2 className="policy__subtitle">Административная юрисдикция</h2>

                <p className="policy__text">Данные правила будут регулироваться и толковаться в соответствии с законодательством Российской Федерации. Используя данный веб-сайт, 
                вы соглашаетесь, что любые споры, возникающие в связи с данным веб-сайтом, являются предметом исключительной юрисдикции Российской Федерации.</p>
            </div>
            <Footer />
        </div>
    )
}

export default SiteRules;